---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IntersectionResult
source: html/47a25ca2-165e-1306-38a3-b3fd5bf5e640.htm
---
# IntersectionResult Members

Initializes a new instance of the IntersectionResult class